# Списки сформированы из 10 позитивных и 10 негативных отзывов из примера (texts_opinions.txt)

POSITIVE = ["да", "благодарность", "спасибо", "понравилось", "отличная", "хорошее", "адекватные", "вкусное", "веселые",
            "нормальное", "приятный", "красивые", "восторге", "классные", "клёво", "советую", "вполне", "неплохой",
            "душевного", "дружелюбный", "корректный", "общительный", "качественная", "культурная", "супер", "влюбилась",
            "вежливо", "обожаю", "обязательно", "плюсую", "счастью", "праздничный", "уважаемые", "лучше"]

NEGATIVE = ["печалит", "плохо", "надоедает", "отказывали", "никогда", "сбежав", "закончился", "хамить", "прогонять",
            "пропало", "грязь", "небрежно", "навязчивый", "нет", "обман", "кинули", "сырой", "добил", "увы",
            "умышленно", "перепутать",
            "портить", "нагрубить", "отпало", "надули", "торопятся", "горелое", "помойку", "геноцид", "жалко",
            "обманщикам", "подавится", "позор", "отвратительный", "хуже", "ужасный"]

# может возникнуть ошибка в пути файла, тогда надо заменить на абсолютный путь

texts_opinions = "Reviews_classification/texts_opinions.txt"

texts_ratings = "Reviews_classification/texts_ratings.txt"
